|Variable|Definition|Key|
|---|---|---|
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|gender|gender ||
|Age |Age in years| |
|sibsp |number of siblings / spouses aboard|	|
|parch |number of parents / children aboard| |
|ticket|Ticket number ||
|fare | fare| 	|
|cabin |Cabin number|	|
|embarked|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|
|boat | Lifeboat||
|body | Body Identification Number||
|home.dest| Home/destination||

- Read data and describe it
- Find columns with missingdata
- Print shape of dataset
- drop columns with more than 25% missing data
- drop columns having independent values(which do not affect the survival rate).


- check data types of all columns
- convert price to numeric
- find columns still having missing/na values and also count of missing data
- fill na with mean for fare and age column column.
- drop na values for embarked column.
- dump the dataframe to a csv file 'titanic_filtered.csv'.


- for surviced column replace 0 with D and 1 with A
- find the frequency of different values in survived column
- group by gender and survived and see the counts in each category
- find different pclass and no of people in each class

- find top 5 people with highest values of age. Count no of male and females in the top 5
- find max age male and female who survived
- get average age by gender
- get average age by people survived vs not-survived

In [1]:
import numpy as np
import pandas as pd

In [2]:
#Read data and describe it
df=pd.read_csv(r'C:\Users\shubham\Desktop\dsc_weekday_1\Assignments\titanic_dataset.csv')

In [3]:
df.describe(include='all')

,Unnamed: 0,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
count,1309.000000,1309.000000,1309.000000,1309,1309,1046.000000,1309.000000,1309.000000,1309,1308,295,1307,486,121.000000,745
unique,NaN,NaN,NaN,1307,2,NaN,NaN,NaN,929,263,186,3,27,NaN,369
top,NaN,NaN,NaN,"Connolly, Miss. Kate",male,NaN,NaN,NaN,CA. 2343,$8.05,C23 C25 C27,S,13,NaN,"New York, NY"
freq,NaN,NaN,NaN,2,843,NaN,NaN,NaN,11,60,6,914,39,NaN,64
mean,654.000000,2.294882,0.381971,NaN,NaN,29.881135,0.498854,0.385027,NaN,NaN,NaN,NaN,NaN,160.809917,NaN
std,378.020061,0.837836,0.486055,NaN,NaN,14.413500,1.041658,0.865560,NaN,NaN,NaN,NaN,NaN,97.696922,NaN
min,0.000000,1.000000,0.000000,NaN,NaN,0.166700,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,1.000000,NaN
25%,327.000000,2.000000,0.000000,NaN,NaN,21.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,72.000000,NaN
50%,654.000000,3.000000,0.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,155.000000,NaN
75%,981.000000,3.000000,1.000000,NaN,NaN,39.000000,1.000000,0.000000,NaN,NaN,NaN,NaN,NaN,256.000000,NaN
max,1308.000000,3.000000,1.000000,NaN,NaN,80.000000,8.000000,9.000000,NaN,NaN,NaN,NaN,NaN,328.000000,NaN

In [4]:
#Find columns with missingdata
df1=df.columns[df.isnull().any()]
print(list(df1))

['age', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest']

In [5]:
#Print shape of dataset
df.shape

(1309, 15)

In [6]:
#drop columns with more than 25% missing data
parc=len(df)*0.75
df.dropna(thresh=parc,axis=1,inplace=True) #thresh takes integer value which tells minimum amount of na values to drop.
print(df.columns)
#print()
#print(df.count()/1309*100)
#print()
#print(df.columns)

Index(['Unnamed: 0', 'pclass', 'survived', 'name', 'gender', 'age', 'sibsp',
       'parch', 'ticket', 'fare', 'embarked'],
      dtype='object')

In [7]:
#drop columns having independent values(which do not affect the survival rate).

df.drop(columns=['Unnamed: 0','name'],inplace=True)
print(df.columns)

Index(['pclass', 'survived', 'gender', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'embarked'],
      dtype='object')

In [8]:
#check data types of all columns
print(df.dtypes)
#or we can check by perticular column
#syn_ex:-df['pclass'].dtype
#print(df.columns)

pclass        int64
survived      int64
gender       object
age         float64
sibsp         int64
parch         int64
ticket       object
fare         object
embarked     object
dtype: object

In [9]:
#convert price to numeric
#df['fare'].astype('float') #error ValueError: could not convert string to float: '$211.34 '
print(df.head(3))
print()
df['fare']=df['fare'].replace('[$]','',regex=True)
df['fare'] = pd.to_numeric(df['fare'])
print()
print(df.tail(3))
print()
print(df['fare'])

   pclass  survived  gender      age  sibsp  parch  ticket      fare embarked
0       1         1  female  29.0000      0      0   24160  $211.34         S
1       1         1    male   0.9167      1      2  113781  $151.55         S
2       1         0  female   2.0000      1      2  113781  $151.55         S


      pclass  survived gender   age  sibsp  parch  ticket  fare embarked
1306       3         0   male  26.5      0      0    2656  7.23        C
1307       3         0   male  27.0      0      0    2670  7.23        C
1308       3         0   male  29.0      0      0  315082  7.88        S

0       211.34
1       151.55
2       151.55
3       151.55
4       151.55
         ...
1304     14.45
1305     14.45
1306      7.23
1307      7.23
1308      7.88
Name: fare, Length: 1309, dtype: float64

In [10]:
#find columns still having missing/na values and also count of missing data
m_col=df.columns[df.isna().any()]
print(m_col)
print()
m_val=df.isna().sum()
print(m_val)

Index(['age', 'fare', 'embarked'], dtype='object')

pclass        0
survived      0
gender        0
age         263
sibsp         0
parch         0
ticket        0
fare          1
embarked      2
dtype: int64

In [11]:
#fill na with mean for fare and age column column.p
print(df['fare'].isna().sum())
mean_fare=(df['fare'].mean())
print(mean_fare)
df['fare'].fillna(mean_fare,inplace=True)
print(df['age'].isna().sum())
mean_age=(df['age'].mean())
df['age'].fillna(mean_age,inplace=True)
print(mean_age)

1
33.29626146789031
263
29.8811345124283

In [12]:
#drop na values for embarked column.
print(df['embarked'].isna().sum())
print(df.dropna(subset=['embarked'],inplace=True))

2
None

In [13]:
#dump the dataframe to a csv file 'titanic_filtered.csv'.
df.to_csv(r'titanic_filtered.csv')

In [14]:
#for surviced column replace 0 with D and 1 with A
print(df.survived)
df['survived'].replace([0,1],['D','A'],inplace=True)
print(df['survived'])

0       1
1       1
2       0
3       0
4       0
       ..
1304    0
1305    0
1306    0
1307    0
1308    0
Name: survived, Length: 1307, dtype: int64
0       A
1       A
2       D
3       D
4       D
       ..
1304    D
1305    D
1306    D
1307    D
1308    D
Name: survived, Length: 1307, dtype: object

In [15]:
#find the frequency of different values in survived column
print(df.survived.unique())
print(df.survived.value_counts())

['A' 'D']
D    809
A    498
Name: survived, dtype: int64

In [16]:
#group by gender and survived and see the counts in each category
grp_gen_sur=df.groupby(by=['gender','survived']).groups
print(grp_gen_sur)
#print(grp_gen_sur.columns.value_counts())

{('female', 'A'): Int64Index([   0,    6,    8,   11,   12,   13,   17,   18,   21,   23,
            ...
            1223, 1244, 1247, 1257, 1258, 1260, 1261, 1286, 1290, 1300],
           dtype='int64', length=337), ('female', 'D'): Int64Index([   2,    4,  105,  169,  286,  365,  369,  381,  382,  411,
            ...
            1227, 1230, 1231, 1265, 1267, 1273, 1276, 1279, 1304, 1305],
           dtype='int64', length=127), ('male', 'A'): Int64Index([   1,    5,   14,   20,   22,   26,   29,   31,   37,   47,
            ...
            1196, 1228, 1232, 1233, 1236, 1238, 1240, 1254, 1256, 1277],
           dtype='int64', length=161), ('male', 'D'): Int64Index([   3,    7,    9,   10,   15,   16,   19,   25,   30,   34,
            ...
            1296, 1297, 1298, 1299, 1301, 1302, 1303, 1306, 1307, 1308],
           dtype='int64', length=682)}

In [17]:
#find different pclass and no of people in each class
print(df['pclass'].value_counts())

3    709
1    321
2    277
Name: pclass, dtype: int64

In [18]:
#find top 5 people with highest values of age. Count no of male and females in the top 5
h_age=df.nlargest(5,'age')
print(h_age)
print(h_age['gender'].value_counts())

      pclass survived  gender   age  sibsp  parch    ticket   fare embarked
14         1        A    male  80.0      0      0     27042  30.00        S
61         1        A  female  76.0      1      0     19877  78.85        S
1235       3        D    male  74.0      0      0    347060   7.78        S
9          1        D    male  71.0      0      0  PC 17609  49.50        C
135        1        D    male  71.0      0      0  PC 17754  34.65        C
male      4
female    1
Name: gender, dtype: int64

In [19]:
#find max age male and female who survived
max_age_survived=df.groupby(by='gender')['age'].max()
print(max_age_survived)

gender
female    76.0
male      80.0
Name: age, dtype: float64

In [21]:
#get average age by gender
avg_age_gen=df.groupby(by='gender')['age'].mean()
print(avg_age_gen)

gender
female    28.795931
male      30.430716
Name: age, dtype: float64

In [23]:
#get average age by people survived vs not-survived
avg_age_p=df.groupby(by='survived')['age'].mean()
print(avg_age_p)

survived
A    28.974711
D    30.389368
Name: age, dtype: float64